In [1]:
import numpy as np
import pandas as pd
import json
data = pd.read_csv("tmdb_5000_credits.csv")
data.head()

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."
3,49026,The Dark Knight Rises,"[{""cast_id"": 2, ""character"": ""Bruce Wayne / Ba...","[{""credit_id"": ""52fe4781c3a36847f81398c3"", ""de..."
4,49529,John Carter,"[{""cast_id"": 5, ""character"": ""John Carter"", ""c...","[{""credit_id"": ""52fe479ac3a36847f813eaa3"", ""de..."

In [2]:
data["cast"][0][1:150]

'{"cast_id": 242, "character": "Jake Sully", "credit_id": "5602a8a7c3a3685532001c9a", "gender": 2, "id": 65731, "name": "Sam Worthington", "order": 0}'

In [3]:
data["crew"][0][1:138]

'{"credit_id": "52fe48009251416c750aca23", "department": "Editing", "gender": 0, "id": 1721, "job": "Editor", "name": "Stephen E. Rivkin"}'

In [4]:
castDf = pd.DataFrame({'movieId':[], 'person_name':[], 'role':[]})

for index, row in data.iterrows():
    movieId = row['movie_id'] 
    c = pd.DataFrame.from_dict(json.loads(row['cast']))
    for index, row in c.iterrows():
        castDf.loc[len(castDf)] = [str(movieId), row['name'], row['character']]  
print(castDf.head())

  movieId         person_name                 role
0   19995     Sam Worthington           Jake Sully
1   19995         Zoe Saldana              Neytiri
2   19995    Sigourney Weaver  Dr. Grace Augustine
3   19995        Stephen Lang        Col. Quaritch
4   19995  Michelle Rodriguez         Trudy Chacon

In [5]:
castDf.count()

movieId        106257
person_name    106257
role           106257
dtype: int64

In [6]:
print(list(castDf.columns))
castDf.drop(castDf.filter(regex="Unnamed"),axis=1, inplace=True)
print(castDf.head())
print(castDf.count())

['movieId', 'person_name', 'role']
  movieId         person_name                 role
0   19995     Sam Worthington           Jake Sully
1   19995         Zoe Saldana              Neytiri
2   19995    Sigourney Weaver  Dr. Grace Augustine
3   19995        Stephen Lang        Col. Quaritch
4   19995  Michelle Rodriguez         Trudy Chacon
movieId        106257
person_name    106257
role           106257
dtype: int64

In [7]:
d = {}
for i in castDf['person_name']:
    d[i] = d.get(i,0) + 1

In [8]:
newdf = pd.DataFrame(list(d.items()),columns = ['person_name','count'])
newdf

              person_name  count
0         Sam Worthington     10
1             Zoe Saldana     20
2        Sigourney Weaver     33
3            Stephen Lang     11
4      Michelle Rodriguez     13
...                   ...    ...
54196     Daniella Pineda      1
54197       Laci J Mailey      1
54198          Zhu Shimao      1
54199    Brian Herzlinger      1
54200         Bill D'Elia      1

[54201 rows x 2 columns]

In [9]:
newdf = newdf[newdf['count']>5]
newdf

              person_name  count
0         Sam Worthington     10
1             Zoe Saldana     20
2        Sigourney Weaver     33
3            Stephen Lang     11
4      Michelle Rodriguez     13
...                   ...    ...
41911      John Carradine      6
44294        Frank Harper      6
44804        Bess Flowers      8
46703        Gino Corrado      6
47741        Bert Stevens      6

[2952 rows x 2 columns]

In [10]:
l = list(newdf['person_name'])

In [11]:
castDf = castDf[castDf['person_name'].isin(l)]
castDf.count()

movieId        33470
person_name    33470
role           33470
dtype: int64

In [12]:
directorDf = pd.DataFrame({'movieId':[], 'person_name':[]})

for index, row in data.iterrows():
    movieId = row['movie_id']
    crew = pd.DataFrame.from_dict(json.loads(row['crew']))
    if (not (crew.empty)):
        nameList = crew[crew['job']=='Director']['name'].values
        if (len(nameList)>0):
            directorDf.loc[len(directorDf)] = [str(movieId), nameList[0]]  
directorDf.count()

movieId        4773
person_name    4773
dtype: int64

In [13]:
directorDf['person_name']

0           James Cameron
1          Gore Verbinski
2              Sam Mendes
3       Christopher Nolan
4          Andrew Stanton
              ...
4768     Robert Rodriguez
4769         Edward Burns
4770          Scott Smith
4771          Daniel Hsia
4772     Brian Herzlinger
Name: person_name, Length: 4773, dtype: object

In [14]:
d = {}
for i in directorDf['person_name']:
    d[i] = d.get(i,0) + 1

In [15]:
newdf = pd.DataFrame(list(d.items()),columns = ['person_name','count'])
newdf

            person_name  count
0         James Cameron      7
1        Gore Verbinski      7
2            Sam Mendes      7
3     Christopher Nolan      8
4        Andrew Stanton      4
...                 ...    ...
2344      Shane Carruth      1
2345   Neill Dela Llana      1
2346        Scott Smith      1
2347        Daniel Hsia      1
2348   Brian Herzlinger      1

[2349 rows x 2 columns]

In [16]:
newdf = newdf[newdf['count']>3]
newdf

            person_name  count
0         James Cameron      7
1        Gore Verbinski      7
2            Sam Mendes      7
3     Christopher Nolan      8
4        Andrew Stanton      4
...                 ...    ...
1723       Edward Burns      4
1737     Richard Brooks      4
1766          John Ford      4
1771        Frank Capra      5
1881      Alex Kendrick      4

[339 rows x 2 columns]

In [17]:
l = list(newdf['person_name'])

In [18]:
directorDf = directorDf[directorDf['person_name'].isin(l)]
directorDf.count()

movieId        2058
person_name    2058
dtype: int64

In [19]:
castDf.to_csv('roles.csv')
directorDf.to_csv('directors.csv')